{
    "_name_or_path": "facebook/blenderbot_small-90M",
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "add_bias_logits": false,
    "add_emo_cross_attn": false,
    "add_final_layer_norm": false,
    "architectures": [
      "BlenderbotSmallForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "classif_dropout": 0.0,
    "classifier_dropout": 0.0,
    "contrastive_loss_ratio": 0.2,
    "d_model": 512,
    "decoder_attention_heads": 16,
    "decoder_ffn_dim": 2048,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 8,
    "decoder_start_token_id": 1,
    "do_blenderbot_90_layernorm": true,
    "dropout": 0.1,
    "emo_from_eos": true,
    "emo_from_situ": false,
    "emo_loss_ratio": 0.05,
    "emo_out_loss_ratio": 0.05,
    "emo_use_cat_attn": false,
    "encoder_attention_heads": 16,
    "encoder_ffn_dim": 2048,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 8,
    "eos_token_id": 2,
    "extra_pos_embeddings": 0,
    "force_bos_token_to_be_generated": false,
    "forced_eos_token_id": 2,
    "fuse_z": false,
    "gradient_checkpointing": false,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1",
      "2": "LABEL_2"
    },
    "init_std": 0.02,
    "intensity_vae": false,
    "is_encoder_decoder": true,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1,
      "LABEL_2": 2
    },
    "latent_dim": 256,
    "layernorm_variant": "xlm",
    "length_penalty": 0.65,
    "lstm_st_seq": false,
    "max_length": 128,
    "max_position_embeddings": 512,
    "merge": false,
    "min_length": 20,
    "mixed_vae": false,
    "model_type": "blenderbot-small",
    "n_emo_out": 28,
    "no_fuse": true,
    "no_repeat_ngram_size": 3,
    "normalize_before": false,
    "normalize_embedding": true,
    "num_beams": 10,
    "num_hidden_layers": 8,
    "pad_token_id": 0,
    "prepend": false,
    "rl_emb_ratio": -1.0,
    "sample_strat_emb": false,
    "sample_strategy_embedding": true,
    "scale_embedding": true,
    "st_from_eos": false,
    "static_position_embeddings": false,
    "stg_use_cat_attn": false,
    "stop_norm_weight": false,
    "strategy_loss_ratio": 0.05,
    "transformers_version": "4.2.2",
    "unk_token_id": 3,
    "use_cache": true,
    "use_centroid_loss": false,
    "use_contrastive_loss": true,
    "use_copy": false,
    "use_emb_prep": true,
    "use_emo_in_dist": false,
    "use_kl": true,
    "use_role_embed": true,
    "use_situ_in_decoder": false,
    "use_situ_in_encoder": false,
    "use_st_seq": false,
    "use_th_attn": false,
    "use_trans_mat": true,
    "use_uncertainty_loss": false,
    "use_vad_labels": false,
    "use_vae": false,
    "vad_emb_ratio": -1,
    "vocab_size": 54944,
    "wo_Sresp": false,
    "wo_comet": false,
    "wo_emo": false,
    "wo_stra": false
  }
  